using Planinarenje;
internal class Program
{
    private static void Main(string[] args)
    {
        /*
         1) (укупно 70 поена) Саставити на језику Java следећи пакет класа:
  (10 поена) Планина има име и висину (у метрима), који могу да се дохвате. Може да се
 састави текстуални опис у облику име(висина), као и текстуални опис низа планина у облику
 планина, планина, ..., планина.
  (30 поена) Планинар има име, јединствени целобројни идентификациони број и збирку
 планина задатог капацитета. Збирка се ствара празна, након чега планине могу да се додају
 једна по једна. Планинар може да се пење по задатој планини. Пењање треба да врати
 индикатор успешности (true/false). Уколико је пењање било успешно, задата планина се
 ставља у збирку планина и враћа се true. Уколико је пењање било неуспешно враћа се false.
 Може да се састави текстуални опис планинара у облику име-идентификатор(планина,
 планина, ..., планина).
  Класични планинар је планинар који се пење по планинама нижим од 2000m, иначе је
 пењање неуспешно. Текстуални облик је К_име-идент(планина, планина, ..., планина).
  Алпиниста је планинар коме може да се додели други алпиниста као партнер и који се пење
 по планинама вишим од 3000m. Партнер не може да буде класични планинар. Уколико
 алпиниста нема додељеног партнера или је планина нижа од 3000m, пењање је неуспешно.
 Текстуални опис је A_име-идент(планина, планина, ..., планина).
  (30 поена) Планинарско друштво има назив, годину оснивања и листу планинара. Ствара се
 са непразном листом планинара (оснивача). Планинар може да се учлани, при чему се додаје
 на крај листе. Moже да се дохвати планинар са задате позиције у листи (позиције иду од 1) и
 да се дохвати укупан број планинара у листи. Текстуални опис садржи опис сваког
 планинара у посебном реду.
 (0 поена) Приложена је класа са главном функцијом која направи две планине, Монт Блан
 висине 4807m и Златибор висине 1496m, а затим планинарско друштво са задатим алпинистом
 и класичним планинаром. Затим се планинарском друштву додају још један алпиниста и још
 један класични планинар. Након тога се првом планинару у друштву зада да се пење на Монт
 Блан, а другом да се пење на Златибор. Затим се првом планинару у друштву додели трећи
 планинар као партнер и обрнуто и оба планинара се пошаљу на Монт Блан. После сваког слања
 на планину на стандардном излазу се испише планинар, планина и статус успеха пењања. На
 крају се прикаже планинарско друштво на стандардном излазу

         */
    }
}